use std::{thread, time};

#[derive(Clone, Copy)]
enum PieceKind {
    I,
    O,
    T,
    J,
    L,
}

const PIECE: [[[usize; 4]; 4]; 5] = [
    // I
    [
        [0,0,0,0],
        [0,0,0,0],
        [1,1,1,1],
        [0,0,0,0]
    ],
    // 四角
    [
        [0,0,0,0],
        [0,1,1,0],
        [0,1,1,0],
        [0,0,0,0]
    ],
    // 凸型
    [
        [0,0,0,0],
        [0,0,0,0],
        [0,1,0,0],
        [1,1,1,0]
    ],
    // J型
    [
        [0,0,0,0],
        [1,0,0,0],
        [1,1,1,0],
        [0,0,0,0]
    ],
    // L型
    [
        [0,0,0,0],
        [0,0,1,0],
        [1,1,1,0],
        [0,0,0,0]
    ]
];

struct Position {
    x: usize,
    y: usize,
}

fn is_collision(field: &[[usize;14]], pos: &Position, piece: PieceKind) -> bool {
    for y in 0..4 {
        for x in 0..4 {
            if field[y+pos.y+1][x+pos.x] & PIECE[piece as usize][y][x] == 1 {
                return true;
            }
        }
    }
    false
}

fn main() {
    let field = [
        [1,1,1,1,1,1,1,1,1,1,1,1,1,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,0,0,0,0,0,0,0,0,0,0,0,0,1],
        [1,1,1,1,1,1,1,1,1,1,1,1,1,1],
    ];

    let mut position = Position {
        x: 4,
        y: 0,
    };

    // 画面クリア
    println!("\x1b[2J\x1b[H\x1b[?25l");

    for _ in 0..30 {
        let mut field_buf = field;

        if !is_collision(&field, &position, PieceKind::I) {
             // posのy座標を更新
            position.y += 1;
        }

        for y in 0..4 {
            for x in 0..4 {
                field_buf[y+position.y][x+position.x] |= PIECE[PieceKind::I as usize][y][x];
            }
        }

        // position.y += 1;
        println!("\x1b[H");  // カーソルを先頭に移動

        for y in 0..26 {
            for x in 0..14 {
                if field_buf[y][x] == 1 {
                    if x == 0 || x == 13 {
                        print!("|");
                    } else if y == 0 {
                        print!("~~");
                    } else if y == 25 {
                        print!("__");
                    } else {
                        print!(" ■");
                    }
                } else {
                    print!("  ");
                }
            }
            println!();
        }
        thread::sleep(time::Duration::from_millis(300));
    }
    // カーソルを再表示
    println!("\x1b[?25h");
}
